import React from 'react';

const SelfPR = () => {
  return (
    <div>
      <h2>Self PR</h2>
        <h3>システム開発の経験</h3>
        <p>私はシステムの要件定義・機能設計・詳細設計・開発・テスト・リリースまでの一連のフェーズを経験してきました。その経験から、総合的な開発プロジェクトのスキル・能力を持ち合わせています。例えば、機能設計やテストフェーズにおいては、実際にシステムを使用したときにどのようにお客様が感じるのか、ユーザー目線での実施を心がけてきました。</p>
        <h3>自ら取り組む力</h3>
        <p>仕事を進めていくうえで担当された業務に対して、毎回上司に教えていただくのではなく、手順を自らで考えながら課題を解決する力をつけてきました。例えば、初期費用が３億円を超える基幹システムの保守作業を担当させていただいており、当初は先輩社員の横で眺めていただけだったところを、詳細設計の見るべき部分、DBの構造、問い合わせの種類を見分ける力などを身につけていき、一人でも解決できる幅を増やしてきました。</p>
        <h3>他者尊重と自己主張</h3>
        <p>私は相手のことを尊重しながら自分の意見をしっかりと伝えることができます。相手の意見を聞き、相手がなぜそう考えたのかを理解するよう努めています。そして、自分の考えをわかりやすく伝えるために、伝える情報や伝え方に気を付けています。</p>
    </div>
  );
};

export default SelfPR;
